{
    "current": "en",
    "denomination": "English",
    "title": "Adobe Portfolio",
    "flag_img": "british.png",
    "loader": {
        "texts": [
            "Reading preferences...",
            "Initializing tools...",
            "Loading the palette...",
            "Creating color conversion tables...",
            "Reading brushes...",
            "Loading .",
            "Loading . .",
            "Loading . . ."
        ],
        "illustration_creator": "Illustration by Flore Marquin",
        "illustration_inspiration": "Illustration inspired by The Lord of the Rings: The Rings of Power. \"For more details and legal information, please visit the screen.\""
    },
    "menu": {
        "home": "Home",
        "background": "Background",
        "myself": "Myself",
        "contact": "Contact",
        "about": "About"
    },
    "footer": {
        "about": "About"
    },
    "index": {
        "title": "Adobe Portfolio - Rayane Merlin",
        "discover": "Get started",
        "description": [
            "Rayane Merlin", 
            "Full Stack Developper", 
            "Designer", 
            "IT Student (BAC +3)"
        ],
        "credentials": "Credentials"
    },
    "home": {
        "title": "Home",
        "projects": "My Projects",
        "projects_desc": "Here you'll find my important projects, whether they are academic or personal.<br/>Just click to download them.",
        "projects_frame": {
            "languages": "Language",
            "skills": "Skill",
            "description": "Description",
            "for_using": "For using",
            "consult": "Consult",
            "download": "Download",
            "file_size": "Filesize",
            "quit": "Quit",
            "quit_preview": "Quit preview",
            "repository": "Github repository"
        },
        "cv": "My CV",
        "cv_subtext_1": "Feel free to click on the CV image to zoom in; this will allow you to view it in its optimal quality without needing to download it.",
        "cv_frame": {
            "text": "Important to know:<br/><br/>Here is my CV, it's subject to change over time, in a few months it will be different. <br/>Feel free to visit this site, it's updated very regularly and will therefore inevitably contain the latest version.",
            "quit": "Quit",
            "size": "Size",
            "modification": "Modification",
            "type": "Type"
        },
        "cv_subtext_2": "You can download my current CV in pdf format by clicking the button below.",
        "download": "Download",
        "skills": "My Skills",
        "is": "is"
    },    
    "background": {
        "title": "My background",
        "main_text": "What's this page?",
        "main_subtext_1": "Here's my academic background from obtaining my high school diploma to the present day.",
        "main_subtext_2": "Click on each box to learn more about each semester, their content, and the projects completed.",
        "consult": "Consult",
        "semester_frame": {
            "dates": "Dates",
            "school": "School",
            "specialties": "Specialties",
            "subjects": "Subjects",
            "subjects_text": "Here are the subjects studied and their corresponding coefficients.",
            "see_subjects": "See subjects"
        }
    },
    "myself": {
        "title": "Who am I ?",
        "description": "I am a {{age}}-year-old student, passionate about computer science and new technologies. Currently in my second year of a Bachelor's degree in Computer Science, I aim to further my studies in the field of development and design.",
        "musics": "My musics",
        "musics_description": "Here are some songs that have marked me. I allow myself to talk about them in this portfolio because music holds an important place in my life and in general society. What we listen to somehow represents who we are and is a source of creativity that influences us as listeners.",
        "references": "References"
    },
    "contact": {
        "title": "Contact",
        "description": "For any contact, you can also use this page.<br/>It's very simple:<br/>• Enter the name/pseudonym under which you will send the message<br/>• Enter your email address<br/>• Simply enter your message!",
        "name": "Your name",
        "name_placeholder": "Firstname Lastname",
        "email": "Your email address",
        "email_placeholder": "example@example.com",
        "message": "Message",
        "message_placeholder": "Here's my message..",
        "send": "Send",
        "reset": "Reset",
        "no_chars_left": "No char left",
        "one_char_left": "char left",
        "chars_left": "chars left",
        "error": "An error occurred while sending the message.",
        "error_name": "Please enter a valid name",
        "error_mail": "Please enter a valid email address",
        "error_message": "Please enter a message"
    },
    "about": {
        "title": "About",
        "main_title": "Privacy Policy",
        "main_text": "Your privacy is important to me. Adobe Portfolio's policy is to respect your privacy and to comply with all applicable laws and regulations regarding the personal information I may collect about you, including on my website, via the address",
        "main_text_explaination": "This policy has been in effect since February 7, 2023, and was last updated on February 7, 2023.",
        "contact_me": "Contact Me",
        "contact_me_text": "For any questions or concerns regarding your privacy, you can contact me using the following contact information:",
        "informations": "Collected Information",
        "informations_text": "The information I collect includes both information that you knowingly and actively provide when using or participating in any of our services and promotions, and any information automatically sent by your devices when accessing our products and services.",
        "log_data": "Log Data",
        "log_data_text": "When you visit this website, servers may automatically record standard data provided by your web browser. This may include your device's IP address (Internet Protocol), browser type and version, the pages you visit, the time and date of your visit, the time spent on each page, other details about your visit, and technical details that occur in conjunction with errors you may encounter. <br/> Please note that while this information may not be personally identifiable on its own, it may be possible to combine it with other data to personally identify individual persons.",
        "inspirations_text": "This site was entirely coded by myself with the purpose of presenting my background, projects, and skills. <br/> Similarly, all projects presented may have been partially or entirely coded by myself. <br/> The logo was inspired by the official logo of Adobe Photoshop (more generally, by all logos of the Adobe Suite). The loader was inspired by the official loading of Adobe Photoshop 2022.",
        "personal_data": "Personal Data",
        "personal_data_text": "You may be asked for personal information that may include one or more of the following items: <br/>• Name <br/>• Email",
        "cookies": "Use of Cookies",
        "cookies_text": "The use of 'cookies' to collect information about you and your activity on our site. A cookie is a small data element that our website stores on your computer and accesses each time you visit, so that I can understand how you use our site."
    },
    "not_found": {
        "title": "Page not found"
    }
}
