{
    "current": "es",
    "denomination": "Español",
    "title": "Adobe Portfolio",
    "flag_img": "spanish.png",
    "loader": {
        "texts": [
            "Preferencias de lectura...",
            "Inicializando herramientas...",
            "Cargando la paleta...",
            "Creando tablas de conversión de color...",
            "Leyendo pinceles...",
            "Cargando .",
            "Cargando . .",
            "Cargando . . ."
        ],
        "illustration_creator": "Ilustración de Flore Marquin",
        "illustration_inspiration": "Ilustración inspirada en El Señor de los Anillos: Los Anillos del Poder. Para más detalles e información legal, visite la pantalla."
    },
    "menu": {
        "home": "Inicio",
        "background": "Antecedentes",
        "myself": "Sobre mí",
        "contact": "Contacto",
        "about": "Acerca de"
    },
    "footer": {
        "about": "Acerca de"
    },
    "index": {
        "title": "Adobe Portfolio - Rayane Merlin",
        "discover": "Empezar",
        "description": [
            "Rayane Merlin",
            "Desarrollador Full Stack",
            "Diseñador",
            "Estudiante de IT (BAC +3)"
        ],
        "credentials": "Credenciales"
    },
    "home": {
        "title": "Inicio",
        "projects": "Mis Proyectos",
        "projects_desc": "Aquí encontrarás mis proyectos importantes, ya sean académicos o personales.<br/>Simplemente haz clic para descargarlos.",
        "projects_frame": {
            "languages": "Idioma",
            "skills": "Habilidad",
            "description": "Descripción",
            "for_using": "Para usar",
            "consult": "Consultar",
            "download": "Descargar",
            "file_size": "Tamaño del archivo",
            "quit": "Salir",
            "quit_preview": "Salir de la vista previa"
        },
        "cv": "Mi CV",
        "cv_subtext_1": "Siéntete libre de hacer clic en la imagen del CV para hacer zoom; esto te permitirá verlo en su calidad óptima sin necesidad de descargarlo.",
        "cv_frame": {
            "text": "Importante saber:<br/><br/>Aquí está mi CV, está sujeto a cambios con el tiempo, en unos meses será diferente. <br/>Siéntete libre de visitar este sitio, se actualiza muy regularmente y, por lo tanto, inevitablemente contendrá la última versión.",
            "quit": "Salir",
            "size": "Tamaño",
            "modification": "Modificación",
            "type": "Tipo"
        },
        "cv_subtext_2": "Puedes descargar mi CV actual en formato PDF haciendo clic en el botón de abajo.",
        "download": "Descargar",
        "skills": "Mis Habilidades",
        "is": "es"
    },
    "background": {
        "title": "Mi Antecedentes",
        "main_text": "¿Qué es esta página?",
        "main_subtext_1": "Aquí tienes mi trayectoria académica desde que obtuve mi diploma de secundaria hasta el día de hoy.",
        "main_subtext_2": "Haz clic en cada cuadro para obtener más información sobre cada semestre, su contenido y los proyectos completados.",
        "consult": "Consultar",
        "semester_frame": {
            "dates": "Fechas",
            "school": "Escuela",
            "specialties": "Especialidades",
            "subjects": "Asignaturas",
            "subjects_text": "Aquí se muestran las asignaturas estudiadas y sus coeficientes correspondientes.",
            "see_subjects": "Ver asignaturas"
        }
    },
    "myself": {
        "title": "¿Quién soy?",
        "description": "Soy un estudiante de {{age}} años, apasionado por la informática y las nuevas tecnologías. Actualmente en mi segundo año de Licenciatura en Ciencias de la Computación, mi objetivo es continuar mis estudios en el campo del desarrollo y diseño.",
        "musics": "Mi Música",
        "musics_description": "Aquí tienes algunas canciones que me han marcado. Me permito hablar de ellas en este portfolio porque la música ocupa un lugar importante en mi vida y en la sociedad en general. Lo que escuchamos de alguna manera representa quiénes somos y es una fuente de creatividad que nos influye como oyentes.",
        "references": "Referencias"
    },
    "contact": {
        "title": "Contacto",
        "description": "Para cualquier contacto, también puedes usar esta página.<br/>Es muy simple:<br/>• Ingresa el nombre/pseudónimo con el que enviarás el mensaje<br/>• Ingresa tu dirección de correo electrónico<br/>• ¡Simplemente ingresa tu mensaje!",
        "name": "Tu nombre",
        "name_placeholder": "Nombre Apellido",
        "email": "Tu dirección de correo electrónico",
        "email_placeholder": "ejemplo@ejemplo.com",
        "message": "Mensaje",
        "message_placeholder": "Aquí está mi mensaje..",
        "send": "Enviar",
        "reset": "Reiniciar",
        "no_chars_left": "Sin caracteres restantes",
        "one_char_left": "carácter restante",
        "chars_left": "caracteres restantes",
        "error": "Se produjo un error al enviar el mensaje.",
        "error_name": "Por favor, ingresa un nombre válido",
        "error_mail": "Por favor, ingresa una dirección de correo electrónico válida",
        "error_message": "Por favor, ingresa un mensaje"
    },
    "about": {
        "title": "Acerca de",
        "main_title": "Política de Privacidad",
        "main_text": "Tu privacidad es importante para mí. La política de Adobe Portfolio es respetar tu privacidad y cumplir con todas las leyes y regulaciones aplicables con respecto a la información personal que pueda recopilar sobre ti, incluso en mi sitio web, a través de la dirección",
        "main_text_explanation": "Esta política ha estado en vigor desde el 7 de febrero de 2023 y fue actualizada por última vez el 7 de febrero de 2023.",
        "contact_me": "Contáctame",
        "contact_me_text": "Para cualquier pregunta o preocupación relacionada con tu privacidad, puedes contactarme utilizando la siguiente información de contacto:",
        "informations": "Información Recopilada",
        "informations_text": "La información que recolecto incluye tanto la información que proporcionas de manera consciente y activa al usar o participar en cualquiera de nuestros servicios y promociones, como cualquier información enviada automáticamente por tus dispositivos al acceder a nuestros productos y servicios.",
        "log_data": "Datos de Registro",
        "log_data_text": "Cuando visitas este sitio web, los servidores pueden registrar automáticamente datos estándar proporcionados por tu navegador web. Esto puede incluir la dirección IP (Protocolo de Internet) de tu dispositivo, el tipo y versión del navegador, las páginas que visitas, la hora y fecha de tu visita, el tiempo que pasas en cada página, otros detalles sobre tu visita y detalles técnicos que ocurran junto con los errores que puedas encontrar. <br/> Ten en cuenta que, aunque esta información por sí sola puede no ser personalmente identificable, puede ser posible combinarla con otros datos para identificar personalmente a personas individuales.",
        "inspirations_text": "Este sitio fue completamente codificado por mí mismo con el propósito de presentar mi trayectoria, proyectos y habilidades. <br/> Del mismo modo, todos los proyectos presentados pueden haber sido parcial o completamente codificados por mí mismo. <br/> El logo fue inspirado por el logo oficial de Adobe Photoshop (más generalmente, por todos los logos de la Suite Adobe). El cargador fue inspirado por la carga oficial de Adobe Photoshop 2022.",
        "personal_data": "Datos Personales",
        "personal_data_text": "Es posible que se te solicite información personal que puede incluir uno o más de los siguientes elementos: <br/>• Nombre <br/>• Correo Electrónico",
        "cookies": "Uso de Cookies",
        "cookies_text": "El uso de 'cookies' para recopilar información sobre ti y tu actividad en nuestro sitio. Una cookie es un pequeño elemento de datos que nuestro sitio web almacena en tu computadora y al que accede cada vez que nos visitas, para que pueda entender cómo usas nuestro sitio."
    },
    "not_found": {
        "title": "Página no encontrada"
    }
}