{
    "current": "fr",
    "denomination": "Français",
    "flag_img": "french.png",
    "title": "Adobe Portfolio",
    "loader": {
        "texts": [
            "Lecture des préférences...",
            "Initialisation des outils...",
            "Chargement de la palette...",
            "Création des tables de conversion des couleurs...",
            "Lecture des pinceaux...",
            "Chargement .",
            "Chargement . .",
            "Chargement . . ."
        ],
        "illustration_creator": "Illustration de Flore Marquin",
        "illustration_inspiration": "Illustration inspirée par le seigneur des anneaux : Les anneaux de pouvoirs. \"Pour obtenir plus de détails et des informations juridiques, rendez vous sur l'écran.\""
    },
    "menu": {
        "home": "Accueil",
        "background": "Parcours",
        "myself": "Perso",
        "contact": "Contact"
    },
    "footer": {
        "about": "À propos"
    },
    "index": {
        "title": "Adobe Portfolio - Rayane Merlin",
        "discover": "Découvrir",
        "description": [
            "Rayane Merlin", 
            "Développeur full-stack", 
            "Designer", 
            "Etudiant en IT (BAC +3)"
        ],
        "credentials": "Crédits"
    },
    "home": {
        "title": "Accueil",
        "projects": "Mes projets",
        "projects_desc": "Vous trouverez ici mes projets importants, qu'ils soient scolaires ou personnels.<br/>Il vous suffit de cliquer pour les télécharger.",
        "projects_frame": {
            "languages": "Langage",
            "skills": "Compétence",
            "description": "Description",
            "for_using": "Utilisation",
            "consult": "Consulter",
            "download": "Télécharger",
            "file_size": "Filesize",
            "quit": "Quitter",
            "quit_preview": "Quitter l'aperçu",
            "repository": "Dépôt Github"
        },
        "cv": "Mon CV",
        "cv_subtext_1": "N'hésitez pas à cliquer sur l'image du C.V pour zoomer, cela vous permettra de le visionner dans sa qualité optimale sans avoir besoin de le télécharger.",
        "cv_subtext_2": "Vous pouvez télécharger mon CV actuel au format pdf en cliquant sur le bouton ci-dessous.",
        "cv_frame": {
            "text": "À savoir :<br/><br/>Voici mon CV, celui-ci est amené à être modifié avec le temps, dans quelques mois il sera différent. <br/>N'hésitez pas à passer sur ce site, celui-ci est mis à jour très régulièrement et contiendra donc forcément la dernière version en date.",
            "quit": "Quitter",
            "size": "Taille",
            "modification": "Modification",
            "type": "Type"
        },
        "download": "Télécharger",
        "skills": "Mes compétences",
        "is": "c'est"
    },
    "background": {
        "title": "Mon parcours",
        "main_text": "Qu'est-ce que cette page ?",
        "main_subtext_1": "Voici mon parcours scolaire allant de l'obtention du bac jusqu'à aujourd'hui.",
        "main_subtext_2": "Cliquez sur chacune des cases pour en savoir plus sur chaque semestre, leur contenu et les projets réalisés.",
        "consult": "Consulter",
        "semester_frame": {
            "dates": "Dates",
            "school": "École",
            "specialties": "Spécialités",
            "subjects": "Matières",
            "subjects_text": "Ici sont les matières étudiées et les coefficients de ces mêmes matières .",
            "see_subjects": "Voir les matières"
        }
    },
    "myself": {
        "title": "Qui suis-je ?",
        "description": "Je suis un étudiant de {{age}} ans, passionné par l'informatique et les nouvelles technologies. Actuellement en deuxième année de BUT informatique, je souhaite poursuivre mes études dans le domaine du développement et du design.",
        "musics": "Mes musiques",
        "musics_description": "Voici quelques musiques qui m'ont marquées. Je me permets d'en parler dans ce PortFolio car la musique possède une place importante dans ma vie et dans la société en général. Ce que nous écoutons représente en quelque sorte qui nous sommes, est une source de créativité influant sur nous : les auditeurs.",
        "references": "Les réferences"
    },
    "contact": {
        "title": "Contact",
        "description": "Pour tout contact, vous pouvez aussi passer par cette page.<br/>Pour cela, c'est très simple : <br/>• Rentrez le nom / pseudonyme sous lequel vous enverrez le message<br/>• Rentrez votre adresse mail<br/>• Rentrez simplement votre message !",
        "name": "Votre nom",
        "name_placeholder": "Nom Prénom",
        "email": "Votre adresse e-mail",
        "email_placeholder": "exemple@exemple.com",
        "message": "Message",
        "message_placeholder": "Voici mon message..",
        "send": "Envoyer",
        "reset": "Réinitialiser",
        "no_chars_left": "Aucun charactère restant",
        "one_char_left": "charactère restant",
        "chars_left": "charactères restants",
        "error": "Une erreur est survenue lors de l'envoi du message.",
        "error_name": "Veuillez entrez un nom valide",
        "error_mail": "Veuillez entrez une adresse mail valide",
        "error_message": "Veuillez entrez un message"
    },
    "about": {
        "title": "À propos",
        "main_title": "Politique de confidentialité",
        "main_text": "Votre vie privée est importante pour moi. La politique d'Adobe PortFolio est de respecter votre vie privée et de se conformer à toutes les lois et réglementations applicables concernant les informations personnelles que je pourrais collecter à votre sujet, y compris sur mon site Web, par l'adresse",
        "main_text_explaination": "Cette politique est en vigueur depuis le 7 février 2023 et a été mise à jour pour la dernière fois le 7 février 2023.",
        "contact_me": "Me contacter",
        "contact_me_text": "Pour toute question ou préoccupation concernant votre vie privée, vous pouvez me contacter en utilisant les coordonnées suivantes :",
        "informations": "Informations collectées",
        "informations_text": "Les informations que je collecte incluent à la fois les informations que vous fournissez sciemment et activement lorsque vous utilisez ou participez à l'un de nos services et promotions, et toute information envoyée automatiquement par vos appareils lors de l'accès à nos produits et services.",
        "log_data": "Log Data",
        "log_data_text": "Lorsque vous visitez ce site Web, les serveurs peuvent enregistrer automatiquement les données standard fournies par votre navigateur Web. Il peut inclure l'adresse IP (Internet Protocol) de votre appareil, le type et la version de votre navigateur, les pages que vous visitez, l'heure et la date de votre visite, le temps passé sur chaque page, d'autres détails sur votre visite et des détails techniques qui se produisent dans conjonction avec les erreurs que vous pourriez rencontrer. <br/> Veuillez noter que même si ces informations peuvent ne pas être personnellement identifiables en elles-mêmes, il peut être possible de les combiner avec d'autres données pour identifier personnellement des personnes individuelles.",
        "inspirations_text": "Ce site a été entièrement codé par mes soins dans le but de présenter mon parcours, mes projets et mes compétences. <br/> De même, tous les projets présentés ont pu être codés en partie ou entièrement par mes soins. <br/> Le logo a été inspiré du logo officiel d'Adobe Photoshop (plus généralement de l\"ensemble des logos de la suite Adobe). Le loader a lui été inspiré du chargement officiel d'Adobe Photoshop 2022.",
        "personal_data": "Données personnelles",
        "personal_data_text": "Il pourrait vous être demandées des informations personnelles qui peuvent inclure un ou plusieurs des éléments suivants :<br/>• Nom<br/>• Email",
        "cookies": "Utilisation des cookies",
        "cookies_text": "L'utilisation des « cookies » pour collecter des informations sur vous et votre activité sur notre site. Un cookie est un petit élément de données que notre site Web stocke sur votre ordinateur et auquel il accède à chaque fois que vous visitez, afin que je puissions comprendre comment vous utilisez notre site."
    },
    "not_found": {
        "title": "Page introuvable"
    }
}