{
    "projects" : [
        {
            "id" : 1,
            "title" : "HTML CV",
            "icon" : "cv-html",
            "use_desc" : null,
            "project_desc" : "Ce projet scolaire personnel a été fait en cours de Web au premier semestre du BUT1, basé uniquement sur le HTML et CSS. Les informations contenues dans celui-ci ne sont pas à jour.\r\nLe but principal de ce projet était de pouvoir travailler sur le positionnement css ainsi que les animations CSS.",
            "is_download" : true,
            "file" : "cv-html.rar",
            "is_link" : true,
            "link" : "cv-html/",
            "image" : null,
            "date" : "10-2021",
            "languages" : ["HTML", "CSS"],
            "uses_skills" : false,
            "uses_languages" : true,
            "has_documentation": false,
            "documentation": null,
            "has_github": false,
            "github": null
        },
        {
            "id" : 2,
            "title" : "Annuaire",
            "icon" : "phone-book",
            "use_desc" : "Le programme est sous forme de terminal. Il suffira simplement de suivre les instructions pour faire l'action souhaité.",
            "project_desc" : "Ce projet de groupe du 1er semestre est un programme en C lisant un fichier CSV dont chaque ligne est un contact (décrit par un Nom, Prenom, Numéro, ...).\r\nLe but étant avec ce programme de pouvoir créer, supprimer, rechercher un contact selon une ou plusieurs informations, ainsi que de pouvoir trier les résultats selon un des attributs des contacts.",
            "is_download" : true,
            "file" : "phone-book.rar",
            "is_link" : false,
            "link" : null,
            "image" : null,
            "date" : "01-2022",
            "languages" : ["C"],
            "uses_skills" : false,
            "uses_languages" : true,
            "has_documentation": false,
            "documentation": null,
            "has_github": false,
            "github": null
        },
        {
            "id" : 3,
            "title" : "Data-Analysis",
            "icon" : "data-analysis",
            "use_desc" : "Lancez simplement le fichier à télécharger avec Power BI, vous pourrez alors voir la base de donnée utilisée ainsi que les graphiques crées.",
            "project_desc" : "Ce projet était un projet scolaire fait en groupe qui consistait à créer des graphiques (avec le logiciel Power BI) permettant de visualiser différents aspects d'une base de données qui nous avait été donnée.",
            "is_download" : true,
            "file" : "Data-Analysis.pbix",
            "is_link" : false,
            "link" : null,
            "image" : null,
            "date" : "06-2022",
            "languages" : ["PowerBI", "SQL"],
            "uses_skills" : false,
            "uses_languages" : true,
            "has_documentation": false,
            "documentation": null,
            "has_github": false,
            "github": null
        },
        {
            "id" : 4,
            "title" : "Poster : Hack",
            "icon" : "poster",
            "use_desc" : null,
            "project_desc" : "Ce projet était un projet scolaire de groupe de communication sur un sujet de notre choix en lien avec l'informatique.\r\nJ'ai travaillée sur la réalisation du design. J'ai trouvé intéressant d'afficher ce projet car il a demandé des compétences en Photoshop et Illustrator que je n'avais pas encore eu l'occasion de travailler ainsi qu'une bonne compréhension de la communication visuelle.",
            "is_download" : true,
            "file" : "Poster-Hack.pdf",
            "is_link" : true,
            "link" : "Poster-Hack.pdf",
            "image" : null,
            "date" : "06-2022",
            "languages" : ["Photoshop", "Illustrator"],
            "uses_skills" : true,
            "uses_languages" : false,
            "has_documentation": false,
            "documentation": null,
            "has_github": false,
            "github": null
        },
        {
            "id" : 5,
            "title" : "GIT Cheat Sheet",
            "icon" : "git",
            "use_desc" : null,
            "project_desc" : "Cet aide mémoire était un projet scolaire de groupe. Dans celui-ci , vous y verrez les commandes git les plus importantes ainsi que leur explication.",
            "is_download" : true,
            "file" : "Git-Cheat-Sheet.pdf",
            "is_link" : true,
            "link" : "Git-Cheat-Sheet.pdf",
            "image" : null,
            "date" : "12-2022",
            "languages" : ["Figma"],
            "uses_skills" : true,
            "uses_languages" : false,
            "has_documentation": false,
            "documentation": null,
            "has_github": false,
            "github": null
        },
        {
            "id" : 6,
            "title" : "Would You Play",
            "icon" : "snake",
            "use_desc" : "Séléctionner le jeu voulu. \r\nChargez le jeu puis choisissez d'ignorer les instructions ou non. Le jeu apparait ensuite. Vous avez une page des préférences pour chacun des jeux. Pour le jeu du snake, cela vous permet de choisir entre différents points (taille du terrain, nombre de pommes...). Pour le jeu des batons, vous pouvez choisir la difficulté du robot, ainsi que le choix principal (choisir celui qui commence ou le nombre de batons).\r\nAttention : Il arrive rarement que les instructions ne s'affichent pas après avoir appuyé sur play ce qui bloque la page. Il suffit de recharger la page pour règler cette erreur.",
            "project_desc" : "Would you play est un projet personnel que j'ai fait basé sur le HTML et le Javascript. Ce site (monopage) vous permet de jouer à différents jeux. Actuellement, un snake avec différentes options ainsi qu'un jeu des bâtons ont été faits.",
            "is_download" : true,
            "file" : "would-you-play.rar",
            "is_link" : true,
            "link" : "would-you-play/",
            "image" : null,
            "date" : "11-2022",
            "languages" : ["HTML", "CSS", "Javascript"],
            "uses_skills" : false,
            "uses_languages" : true,
            "has_documentation": false,
            "documentation": null,
            "has_github": false,
            "github": null
        }, 
        {
            "id" : 7,
            "title" : "E-Ticket",
            "icon" : "ticketing",
            "use_desc" : "Il est nécéssaire de se créer un compte puis se connecter pour profiter de l'ensemble des fonctionnalités. \r\nAjoutez vos billets au panier puis validez votre panier (aucun réel paiement).\r\nVous pouvez télécharger vos billets en PDF dans la section \"Mes billets\".\r\nDans la page de chaque évènement, vous pouvez ajouter un commentaire à l'évènement, ce commentaire peut avoir une ou plusieurs réponses, de j'aimes et des je n'aime pas.\r\nPossibilité d'avoir un compte organisateur, permet de pouvoir ajouter des évènements.",
            "project_desc" : "Utilisation du php pour la connection à la base de données. Inscription, connection et administration de son compte possible.",
            "is_download" : true,
            "file" : "e-ticket.rar",
            "is_link" : true,
            "link" : "e-ticket/",
            "image" : null,
            "date" : "01-2023",
            "languages" : ["PHP", "SQL", "HTML", "CSS", "Javascript"],
            "uses_skills" : false,
            "uses_languages" : true,
            "has_documentation": false,
            "documentation": null,
            "has_github": false,
            "github": null
        },
        {
            "id" : 8,
            "title" : "Hangman Game",
            "icon" : "hangman",
            "use_desc" : "Démarrez une partie en donnant les pseudonymes des deux joueurs puis en validant.\r\nUn des deux joueurs choisis au hasard donnera le mot de son choix et validera ensuite.\r\nL'autre joueur doit ensuite rentrer des lettres, si celles-ci est bonne, la lettre se découvrira dans le mot. Sinon, attention à ne pas trop faire d'erreurs.",
            "project_desc" : "Ce projet scolaire était une mise à niveau en PHP. Il s'agit d'un jeu du pendu tout ce qu'il y a de plus basique qui fonctionne avec les sessions et qui sauvegarde l'ensemble des parties dans une base de données pour les afficher sur la page d'accueil. Le jeu se joue à deux joueurs, l'un donnera le mot et l'autre le cherchera.",
            "is_download" : true,
            "file" : "hangman-game.rar",
            "is_link" : true,
            "link" : "hangman/",
            "image" : null,
            "date" : "03-2023",
            "languages" : ["PHP", "SQL", "HTML", "CSS", "Javascript"],
            "uses_skills" : false,
            "uses_languages" : true,
            "has_documentation": false,
            "documentation": null,
            "has_github": false,
            "github": null
        },
        {
            "id" : 9,
            "title" : "Market Manager",
            "icon" : "market-manager",
            "project_desc" : "Ce projet était un projet scolaire de PHP Symfony. Le but de cette application web est de pouvoir créer, gérer et collaborer sur ses listes de courses. Avec MarketManager, vous pourrez créer des listes et personnaliser les articles à 100% pour ensuite les insérer dans des listes. Vous pourrez ensuite partager vos listes avec vos amis et collaborer sur celles-ci. Vous pourrez aussi créer des listes de courses pour des évènements (anniversaire, mariage, etc...). Vous avez la possibilité de rajouter une date de fin pour vos listes afin de pouvoir les archiver une fois que la date est dépassée.Une des dernières fonctionnalité importante est la possibilité de voir des statistiques sous forme de graphiques sur l'ensemble de vos listes de courses, ainsi que des statistiques plus précises sur chaque liste que vous avez crée.",
            "use_desc" : "Avant tout, pour mettre en place le projet sur votre ordinateur, vous devrez lire le README du projet et rentrer les commandes données. Une fois cela effectué, pour pouvoir utiliser MarketManager, il vous faudra vous créer un compte. Une fois connecté, vous pourrez créer des listes de courses avec des \"templates d'articles\" que vous pourrez personnalisez (changer le prix, le nom, ajouter une marque, augmenter la quantité). Vous pourrez aussi partager vos listes avec vos amis et collaborer sur celles-ci simplement en y ajoutant des collaborateurs avec l'interface de collaboration dans l'onglet d'affichage de listes, il vous suffit d'envoyer une demande de collaboration à un utilisateur existant, une fois cette demande acceptée, l'utilisateur collaborera avec vous sur la liste en question, pourra y rajouter des articles, la voir, mais vous serez le seul à pouvoir modifier les attributs de cette liste (date de fin, nom, description).",
            "is_download" : true,
            "file" : "MarketManager.rar",
            "is_link" : false,
            "link" : "",
            "image" : null,
            "date" : "03-2023",
            "languages" : ["PHP Symfony", "HTML", "CSS", "Javascript"],
            "uses_skills" : false,
            "uses_languages" : true,
            "has_documentation": false,
            "documentation": null,
            "has_github": false,
            "github": null
        },
        {
            "id" : 9,
            "title" : "Kwiz",
            "icon" : "kwiz",
            "project_desc" : "Ce projet est un site web dynamique servant à la création de Quiz, ainsi qu'à la participation à ceux-ci. Il est possible de créer un compte, de se connecter, de créer des quiz, de participer à des quiz. Pour chaque Quiz, il y aura l'affichage des joueurs détenant le meilleur score. Ce projet a été réalisé en React pour le front-end et NodeJS pour le back-end, tout a été fait en Typescript. Le projet est en cours de développement, la partie front-end est faite, il manque désormais le développement du serveur en NodeJS.",
            "use_desc" : "Vous pouvez pour l'instant observer le front-end du site, mais il n'est pas possible de créer un compte, de se connecter, de créer des quiz ou de participer à ceux-ci. Pour pouvoir tester le front-end, il vous suffit de vous rendre sur le dossier app/ du projet dans un terminal et de lancer la commande \"npm install\" puis \"npm start\". Le site sera alors accessible sur votre localhost:3000. Cela nécéssitera d'avoir installé le gestionnaire de dépendances NPM sur votre ordinateur.",
            "is_download" : true,
            "file" : "Kwiz.rar",
            "is_link" : false,
            "link" : "",
            "image" : null,
            "date" : "07-2023",
            "languages" : ["ReactJS", "Typescript", "HTML", "CSS", "NodeJS"],
            "uses_skills" : false,
            "uses_languages" : true,
            "has_documentation": false,
            "documentation": null
        }
    ]
}